# Multiple Page Scraping with BeautifulSoup

by Collins Kimotho

In [4]:
import pandas as pd
from bs4 import BeautifulSoup
import requests

In [73]:
url ='https://books.toscrape.com/catalogue/page-1.html'
response = requests.get(url)
response

In [48]:
html_content = response.text
soup = BeautifulSoup(html_content, 'html.parser')

In [57]:
ol = soup.find("ol", class_='row')

In [58]:
articles = ol.find_all('article', class_='product_pod')

In [72]:

books = []
for article in articles:
    image = article.find('img')
    title = image.attrs['alt']
    star = article.find('p')
    star = star.attrs['class'][1]
    price = article.find('p', class_='price_color').text[2:]
    price =float(price)
    books.append([title, price, star])
print(books)

[['A Light in the Attic', 51.77, 'Three'], ['Tipping the Velvet', 53.74, 'One'], ['Soumission', 50.1, 'One'], ['Sharp Objects', 47.82, 'Four'], ['Sapiens: A Brief History of Humankind', 54.23, 'Five'], ['The Requiem Red', 22.65, 'One'], ['The Dirty Little Secrets of Getting Your Dream Job', 33.34, 'Four'], ['The Coming Woman: A Novel Based on the Life of the Infamous Feminist, Victoria Woodhull', 17.93, 'Three'], ['The Boys in the Boat: Nine Americans and Their Epic Quest for Gold at the 1936 Berlin Olympics', 22.6, 'Four'], ['The Black Maria', 52.15, 'One'], ['Starving Hearts (Triangular Trade Trilogy, #1)', 13.99, 'Two'], ["Shakespeare's Sonnets", 20.66, 'Four'], ['Set Me Free', 17.46, 'Five'], ["Scott Pilgrim's Precious Little Life (Scott Pilgrim #1)", 52.29, 'Five'], ['Rip it Up and Start Again', 35.02, 'Five'], ['Our Band Could Be Your Life: Scenes from the American Indie Underground, 1981-1991', 57.25, 'Three'], ['Olio', 23.88, 'One'], ['Mesaerion: The Best Science Fiction Stories 1800-1849', 37.59, 'One'], ['Libertarianism for Beginners', 51.33, 'Two'], ["It's Only the Himalayas", 45.17, 'Two']]

In [83]:
books = []
for i in range (1, 5):
    url ='https://books.toscrape.com/catalogue/page-{i}.html'
    response = requests.get(url)
    ol = soup.find("ol", class_='row')
    articles = ol.find_all('article', class_='product_pod')
    
    for article in articles:
        image = article.find('img')
        title = image.attrs['alt']
        star = article.find('p')
        star = star.attrs['class'][1]
        price = article.find('p', class_='price_color').text[2:]
        price =float(price)
        books.append([title, price, star])

In [102]:
df=pd.DataFrame(books, columns =['Title', 'Price', 'StarRating'])
df.to_csv('books.csv')
df

                                                Title  Price StarRating
0                                A Light in the Attic  51.77      Three
1                                  Tipping the Velvet  53.74        One
2                                          Soumission  50.10        One
3                                       Sharp Objects  47.82       Four
4               Sapiens: A Brief History of Humankind  54.23       Five
..                                                ...    ...        ...
75  Our Band Could Be Your Life: Scenes from the A...  57.25      Three
76                                               Olio  23.88        One
77  Mesaerion: The Best Science Fiction Stories 18...  37.59        One
78                       Libertarianism for Beginners  51.33        Two
79                            It's Only the Himalayas  45.17        Two

[80 rows x 3 columns]

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Title       80 non-null     object
 1   Price       80 non-null     float64
 2   StarRating  80 non-null     object
dtypes: float64(1), object(2)
memory usage: 2.0+ KB

In [104]:
df.describe()

           Price
count  80.000000
mean   38.048500
std    14.845071
min    13.990000
25%    22.637500
50%    41.380000
75%    51.865000
max    57.250000

In [105]:
df.StarRating.unique()

array(['Three', 'One', 'Four', 'Five', 'Two'], dtype=object)

In [111]:
df['StarRating'] = df['StarRating'].str.replace('One', '1') \
                                   .replace('Two', '2') \
                                   .replace('Three', '3') \
                                   .replace('Four', '4') \
                                   .replace('Five', '5')

In [112]:
df

                                                Title  Price StarRating
0                                A Light in the Attic  51.77          3
1                                  Tipping the Velvet  53.74          1
2                                          Soumission  50.10          1
3                                       Sharp Objects  47.82          4
4               Sapiens: A Brief History of Humankind  54.23          5
..                                                ...    ...        ...
75  Our Band Could Be Your Life: Scenes from the A...  57.25          3
76                                               Olio  23.88          1
77  Mesaerion: The Best Science Fiction Stories 18...  37.59          1
78                       Libertarianism for Beginners  51.33          2
79                            It's Only the Himalayas  45.17          2

[80 rows x 3 columns]

In [118]:
df['StarRating'] = df['StarRating'].astype(float)

In [119]:
df.describe()

           Price  StarRating
count  80.000000    80.00000
mean   38.048500     2.85000
std    14.845071     1.53524
min    13.990000     1.00000
25%    22.637500     1.00000
50%    41.380000     3.00000
75%    51.865000     4.00000
max    57.250000     5.00000

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Title       80 non-null     object
 1   Price       80 non-null     float64
 2   StarRating  80 non-null     float64
dtypes: float64(2), object(1)
memory usage: 2.0+ KB